import java.io.PrintStream;
import java.util.Scanner;
public class Main {
    public static Scanner in = new Scanner(System.in); //для ввода параметров с клавиатуры
    public static PrintStream out = System.out; //для удобного вывода
    public static void main(String[] args) {
        out.print("Введите параметр a: ");
        double a = in.nextDouble(); //ввод параметра а
        out.print("Введите параметр b: ");
        double b = in.nextDouble(); //ввод параметра b
        if (b>=0) {
            out.println("Решим неравенство:" + a + "*" + "x" + "/" + "(x-" + b + ")" + ">=0"); //подставляем параметры в неравенство
            out.println("Ограничение: x ≠ " + b); // знаменатель не может быть равен 0
            if (a>0) {
                out.println("x/(x-" + b + ")" + ">=0"); //поделим обе части неравенства на 'a'
                if (b!=0) // частный случай для 'b' = 0, исключим ноль из области значений 'x'
                    out.println("x ∈ (-∞;" + "0" + "]∪(" + b + ";+∞)"); // получим ответ, воспользовавшись методом интервалов
                else
                    out.println("x ∈ (-∞;" + "0" + ")∪(" + "0" + ";+∞)"); // получим ответ, воспользовавшись методом интервалов
            }
            else {
                if (a == 0 || a == 0.0)
                    out.println("x ∈ (-∞;" + b + ")∪(" + b + ";+∞)"); //частный случай для 'a' = 0
                else {
                    out.println("x/(x-" + b + ")" + "<=0"); //поделим обе части неравенства на 'a'
                    if (b!=0)
                        out.println("x ∈ [0;" + b + ")"); // получим ответ, воспользовавшись методом интервалов
                    else
                        out.println("Нет решений!");
                }
            }
        }
        else {
            out.println("Решим неравенство:" + a + "*" + "x" + "/" + "(x+" + -b + ")" + ">=0"); //подставляем параметры в неравенство
            out.println("Ограничение: x ≠ " + b); // знаменатель не может быть равен 0
            if (a>0) {
                out.println("x/(x+" + -b + ")" + ">=0"); //поделим обе части неравенства на 'a'
                out.println("x ∈ (-∞;" + b + ")∪[" + "0" + ";+∞)"); // получим ответ, воспользовавшись методом интервалов
            }
            else {
                if (a == 0 || a == 0.0)
                    out.println("x ∈ (-∞;" + b + ")∪(" + b + ";+∞)"); //частный случай для 'a' = 0
                else {
                    out.println("x/(x+" + -b + ")" + "<=0"); //поделим обе части неравенства на 'a'
                    out.println("x ∈ (" + b + ";0]"); // получим ответ, воспользовавшись методом интервалов
                }
            }
        }
            }
        }
